"""
1- 模板变量
    {{ 变量名 }}
    {{ key.value }}: 字典取值
    {{ list.index }}: 列表取值

2- 模板语句
    1) for
        {% for i in 列表 %}

        循环体
        {{ forloop.counter }}: 计数器表示当前第几次循环, 从1开始
        {% empty %}: 当列表为空或者不存在执行

        {% endfor %}

    2) if
        {% if ... %}
        逻辑1

        {% elif ... %}
        逻辑2

        {% else %}
        逻辑3

        {% endif%}

        注意：运算符左右两侧不能紧挨变量或常量，必须有空格
        {% if a == 1 %} 正确
        {% if a==1 %} 错误


    3) 比较运算符,
        ==
        !=
        <
        >
        <=
        >=

    4) 布尔运算符
        and
        or
        not


3- 注释
    单行注释: {# .... #}
    多行注释:
        {% comment %}
        ...
        {% endcomment %}


"""
